app/controllers/plants_controller.rb

SELECT * FROM `plants` WHERE (`plants`.`id` = '4') LIMIT 1
---
  def edit
    @plant = Plant.find_by_id(params[:id])

SELECT * FROM `plants` WHERE (`plants`.`id` IS NULL) LIMIT 1
UPDATE `plants` SET `updated_at` = '2010-05-30 06:29:21', `name` = 'eggplant' WHERE `id` = 8
---
  def update_name
    @plant = Plant.find_by_id(params[:id])
    @plant.name = params[:name]
    @plant.save