app/controllers/seeds_controller.rb

  def plant
    @plant = Plant.new
    @plant.state = 'PLANTED'
    @plant.lat = params[:lat]
    @plant.lon = params[:lon]
    @plant.origin_user_id = session[:user]
    @plant.planted_user_id = session[:user]
    @plant.save
---
INSERT INTO `plants` (`name`, `lon`, `updated_at`, `date_planted`, `parent_plant_id`, `origin_user_id`, `planted_user_id`, `plant_id`, `lat`, `state`, `created_at`) VALUES(NULL, -122, '2010-05-30 05:47:40', NULL, NULL, 1, 1, NULL, 37, 'PLANTED', '2010-05-30 05:47:40')

  def position
    session[:seed_id] = params[:id]
    @seed = Type.find_by_id(params[:id])
---
SELECT * FROM `types` WHERE (`types`.`id` = '3') LIMIT 1